{
    "metadata": {
        "intro": "Having educational background in Information Systems, Econometrics, Data Mining and Knowledge Management from three different universities in Europe I would describe myself as an aspiring data scientist. Though, there is still many things to learn before fully deserving that title I try to develop various skills through work and involvement in various projects from the domain of my interests - Data Mining with special emphasis on the Data Visualization and web technologies. This website is supposed to serve as my portfolio, online resume and a blog. I am always looking for new challenges and interesting projects. Should you be interested in the stuff I do please feel free to share or to drop me an email",
        "tags": {
            "js": "Java Script",
            "project": "Project",
            "aboutme": "About me",
            "cv": "Resume / CV",
            "flash": "Flash",
            "webdev": "Web Development",
            "blog": "Blog",	
			"d3": "D3.js",
			"vis": "Visualization",
			"python": "Python",
			"mobile": "Mobile"
        },
        "img_dir": "content/img/"
    },
    "entries": [
		{
			"timestamp": "Decebmer 23, 2014 00:00:00",
            "title": "Campaign targeting tool",
            "tags": ["project", "js", "d3", "vis"],
            "description": "Localytics <a href=\"http://data-viz-challenge.localytics.com/\">data visualization challenge</a> inspired me to create this small project. The task was to create a visualization which will give the answer for the question on how to target a mobile application markating campaign. As I am not an online marketing expert I have decided to create a rather exploratory tool which will allow the expert to find the groups of the potential customers which will be most likely to respond to the campaign. To do that I have created an interactive treemap which partitions all the users into subgroups and for each displays the value of certain metric e.g. average donation per user. Now, the domain expert can experiment with different divisions of the users into subgroups and easily spot interesting groups. Code of the project is open sourced and published on GitHub.",
            "external_link": "http://domajno.github.io/data-viz-challenge/",
            "img_small": "campaign.png"
		},
		{
			"timestamp": "September 18, 2014 00:00:00",
            "title": "Air traffic visualization",
            "tags": ["project", "js", "d3", "vis"],
            "description": "<a href=\"http://neo4j.com/showmeyourgraph-rules/\">Neo4j #ShowMeYourGraph Twitter Contest</a> was my main motivation and a great reason behind many hours spent on experimenting and testing my skills and patience while working with the hive plot. <a href=\"http://www.hiveplot.net/\">Hive plot</a> is a special graph layout by <a href=\"http://mkweb.bcgsc.ca/\">Martin Krzywinski</a> which attempts to position the nodes in a meaningful way which can be interpreted. I really like the idea as I agree that for networks with many nodes and connections it can give much more insights into the data compared to other 'hair ball' styled layouts e.g. force directed. Moreover, I teamed up with <a href=\"http://www.luke-photography.com/\">Lukasz Gajdek</a> - a very good friend of mine who deals with digital media on a daily basis and while I took charge of the tedious work of data cleaning and preparation, he made sure that the final result is really pleasant to look at. In the final stage some scripting was added to make the experience interactive et voila.",
            "external_link": "projects/flights/",
            "img_small": "flights.png"
		},		
		{
			"timestamp": "February 02, 2014 00:00:00",
            "title": "Fashion trends",
            "tags": ["project", "js", "d3", "vis", "python"],
            "description": "End to end development - starting from the idea through research, backend implementation and frontend visualization of the results is really a satisfying experience. This simple application is hosted in the <a href=\"https://www.pythonanywhere.com/\" target=\"_blank\">cloud</a> and exploits many different components to collect and analyze tweets about fashion. Therefore, it can be seen as a social media monitoring tool which attempts to find useful information such as patterns or anomalies in the mass of unstructured text which people publish online. Although the analysis performed is rather simple the results are interesting and many further improvements can be considered e.g. deeper linguistic or sentiment analysis of the tweets and more complex analysis of the collected data.",
            "external_link": "projects/fashion/",
            "img_small": "fashion.png"
		},
		{
			"timestamp": "June 20, 2013 00:00:00",
            "title": "Visualization for Open Xerox",
            "tags": ["project", "js", "webdev", "d3", "vis"],
            "description": "The advent of modern web browsers and open web standards helps to abandon proprietary plugins and allows to create fully interactive content in the browser using open source technologies and standards. That, in the times of information overload leads to the popularization of the visualization tools which give efficient and elegant way for presenting and understanding data. During the internship which was a part of my master programme I had a chance to work in Xerox Research Cetnre Europe in France and develop a visualization framework which operates on top of the Open Xerox web platform. The framework was constructed using Java Script and <a href=\"http://d3js.org/\" target=\"_blank\">D3.js</a> library and is publicly available on <a href=\"http://open.xerox.com/\"  target=\"_blank\">Open Xerox</a>.",
            "external_link": "http://open.xerox.com/",
            "img_small": "ox_small.png"
		},
		{
			"timestamp": "April 09, 2013 00:00:00",
            "title": "Visualizing Daily Deals",
            "tags": ["project", "js", "d3", "vis"],
            "description": "<a href=\"http://crowdanalytix.com/\" target=\"_blank\">Crowdanalytix</a> is a community of the data scientist which offers data-driven business challenges through ideation, predictive analytics and data mining competitions. The task of the first visualization competition was to gain insights into a daily deals industry (e.g. Groupon, LivingSocial) in a quick yet intuitive manner. Visualization techniques are often the very first step in the process of data analysis allowing to expose the structure of the dataset and form hypotheses which should be later veryfied using more sohisticated statistucal approaches. My interactive submission created using <a href=\"http://d3js.org/\" target=\"_blank\">D3.js</a> library and Java Script was placed amongst top 10 winning participants and also received a special price for the most creative submission.",
            "external_link": "http://qroxx.com/visualization/",
            "img_small": "dailydeals_small.png"
		},
		{
            "timestamp": "April 02, 2009 00:00:00",
            "title": "Interactive CV",
            "tags": ["aboutme", "project", "cv", "flash", "vis"],
            "description": "The idea originated while exploring different alternative ways of presenting a resume. Mind mapping techniques appeared particularly interesting however static images seemed to be boring and were not able to convey the dynamic multimedia content. Therefore, I have developed an interactive version of the Curriculum Vitae using Adobe Flash technology to display my resume in a form of a mind map. Mind maps are diagrams allowing to take notes and organize information in a nonlinear way and to outline it visually which is supposed to ease the process of memorization. This idea proved to be successful in attracting potential employers and winning a chance to get interviews as well as <a href=\"http://www.em-dmkm.eu/\" target=\"_blank\">Erasmus Mundus DMKM</a> master programme scholarship.",
            "internal_link": "projects/cv/",
            "img_small": "cv_min.png"
        }
    ]
}
